""" Напишите функцию для транспонирования матрицы """

theArray = [['a','b','c'],['d','e','f'],['g','h','i']]
print(list(zip(*theArray)))
